Documents/ДвижениеДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДвижениеДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Биржа</xr:Item>
				<xr:Item>AccumulationRegister._ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоИнвойсам</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.Зарплата</xr:Item>
				<xr:Item>AccumulationRegister.Деньги</xr:Item>
				<xr:Item>AccumulationRegister.Подотчет</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ПоступлениеСписаниеДС</xr:Item>
				<xr:Item>AccumulationRegister.ПартииВалюты</xr:Item>
				<xr:Item>AccumulationRegister.Инвестиции</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязаноИнвойсов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходРасход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриходРасход</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенег</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцЗП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДКурс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДОбратный</Name>
					<Comment>Обратный расчет (от конечной суммы)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсПартии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентИнвестиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Затрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьСреднийКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инвойсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инвойс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>сумма в валюте инвойса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Comment>Сумма оплаты (в валюте текущего документа)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПересчитыватьПриходТовара</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыПоИнвойсам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоИнвойсам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте инвойса закупки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>валюта инвойса закупки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИнспекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплатыАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦветаОформления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦветаОформления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ЦветаОформления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ЦветаОформления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Долги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Долги</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗакрыто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Частично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неоплачено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДвижениеДенег/Forms/ФормаВыбораИнвойсов/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Курс 	= Параметры.Курс;
	Валюта 	= Параметры.Валюта; 
	Вал 	= Валюта.Символ; 
	
	//Элементы.ИнвойсыИнвойсСумма.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Сумма'; en = 'Сумма'"), Вал); 
	Элементы.ИнвойсыПривязано.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Привязано'; en = 'Привязано'"), Вал); 
	Элементы.ИнвойсыОстатокДолга.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Остаток долга'; en = 'Остаток долга'"), Вал); 
	Если Параметры.Дата <> Дата(1,1,1) Тогда
		Дата = Параметры.Дата;  
		лДата = Дата;    
	ИначеЕсли ЗначениеЗаполнено(Параметры.Документ.Ссылка) Тогда
		Дата = Параметры.Документ.Ссылка.МоментВремени();  
		лДата = Параметры.Документ.Ссылка.МоментВремени().Дата;
	Иначе
		Дата = ТекущаяДатаСеанса();
		лДата = Дата;
	КонецЕсли;
	//Заголовок = СтрШаблон("%1: %2 %3", Параметры.Контрагент, НСтр("ru = 'оплата (привязка) инвойсов на'; en = 'payment (binding) of invoices at'"), лДата);
	Заголовок = СтрШаблон("%1: %2", Параметры.Контрагент, НСтр("ru = 'оплата (привязка) инвойсов'; en = 'payment (binding) of invoices'"));
	
	//СуммаОбщая = Параметры.Документ.Сумма - Параметры.Документ.СуммаПривязаноИнвойсов;
	СуммаОбщая 			= Параметры.Документ.Сумма;
	СуммаПривязано 		= Параметры.Документ.СуммаПривязаноИнвойсов;
	СуммаНеПривязано 	= Макс(0, СуммаОбщая - СуммаПривязано);
	
	глПокраситьВалютыТЗ(ЭтаФорма, "ИнвойсыИнвойсВалюта", "Инвойсы.Инвойс.ДокументОснование.Валюта");  
	
	Запрос = Новый Запрос;     
	// значения формы док-та
	Запрос.УстановитьПараметр("Контрагент", 	Параметры.Контрагент);
	Запрос.УстановитьПараметр("ДвижениеДенег",	Параметры.Документ.Ссылка);
	Запрос.УстановитьПараметр("Проведен",		Параметры.Документ.Ссылка.Проведен);
	Запрос.УстановитьПараметр("ТЧ", 			Параметры.ИнвойсыТЧ.Выгрузить());  
	Запрос.УстановитьПараметр("Курс", 			Курс);
	Запрос.УстановитьПараметр("Валюта", 		Валюта);
	// значения ссылки док-та
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
	
	Запрос.Текст = "ВЫБРАТЬ
		|	тч.Инвойс КАК Инвойс,
		|	тч.Сумма КАК Сумма,
		|	тч.СуммаОплаты КАК СуммаОплаты,
		|	тч.СуммаКР КАК СуммаКР,
		|	тч.НеПересчитыватьПриходТовара КАК НеПересчитыватьПриходТовара
		|ПОМЕСТИТЬ ТЧ
		|ИЗ
		|	&тч КАК тч
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Взаиморасчеты.Инвойс КАК Инвойс,
		|	Взаиморасчеты.Инвойс.СуммаВВалютеИнвойса КАК Сумма,
		|	Взаиморасчеты.СуммаКР КАК СуммаКР,
		|	Взаиморасчеты.Инвойс.Валюта КАК Валюта,
		|	Взаиморасчеты.Долг / ВЫБОР
		|		КОГДА Взаиморасчеты.Инвойс.ДокументОснование.Валюта = &Валюта
		|			ТОГДА 1
		|		ИНАЧЕ &Курс
		|	КОНЕЦ КАК ОстатокДолга,
		|	ВЫБОР
		|		КОГДА Взаиморасчеты.Инвойс.ДокументОснование.Валюта = &Валюта
		|			ТОГДА 1
		|		ИНАЧЕ &Курс
		|	КОНЕЦ КАК Курс,
		|	Взаиморасчеты.Долг > 0 КАК Неоплачено,
		|	Взаиморасчеты.Привязано КАК Привязано,
		|	Взаиморасчеты.НеПересчитыватьПриходТовара КАК НеПересчитыватьПриходТовара,
		|	СостоянияИнвойсов.СтатусОплатыАвто КАК Состояние,
		|	ЕСТЬNULL(ПоступленияТоваров.ЕстьПриходТовара, ЛОЖЬ) КАК ЕстьПриходТовара
		|ИЗ
		|	(ВЫБРАТЬ
		|		Свод.Инвойс КАК Инвойс,
		|		СУММА(Свод.Сумма) КАК Долг,
		|		СУММА(Свод.СуммаОплаты) КАК Привязано,
		|		СУММА(Свод.СуммаКР) КАК СуммаКР,
		|		ЕСТЬNULL(МАКСИМУМ(Свод.НеПересчитыватьПриходТовара), ЛОЖЬ) КАК НеПересчитыватьПриходТовара
		|	ИЗ
		|		(ВЫБРАТЬ
		|			""Данные из формы документа"" КАК Источник,
		|			ТЧ.Инвойс КАК Инвойс,
		|			-ТЧ.Сумма КАК Сумма,
		|			ТЧ.СуммаОплаты КАК СуммаОплаты,
		|			ТЧ.СуммаКР КАК СуммаКР,
		|			ТЧ.НеПересчитыватьПриходТовара КАК НеПересчитыватьПриходТовара
		|		ИЗ
		|			ТЧ КАК ТЧ
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			""Данные из документа, записанного в БД"",
		|			ИнвойсыДокумента.Инвойс,
		|			ИнвойсыДокумента.Сумма,
		|			0,
		|			ИнвойсыДокумента.СуммаКР,
		|			NULL
		|		ИЗ
		|			Документ.ДвижениеДенег.Инвойсы КАК ИнвойсыДокумента
		|		ГДЕ
		|			ИнвойсыДокумента.Ссылка = &ДвижениеДенег
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			""Данные из РН РасчетыПоИнвойсам, не на дату, а все; включают движения тек.док-та"",
		|			РасчетыПоИнвойсам.Инвойс,
		|			РасчетыПоИнвойсам.СуммаОстаток,
		|			0,
		|			0,
		|			NULL
		|		ИЗ
		|			РегистрНакопления.РасчетыПоИнвойсам.Остатки(, Контрагент = &Контрагент) КАК РасчетыПоИнвойсам) КАК Свод
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Свод.Инвойс) КАК Взаиморасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
		|		ПО Взаиморасчеты.Инвойс = СостоянияИнвойсов.Инвойс
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОприходованиеНоменклатуры.Документ КАК Инвойс,
		|			СУММА(ОприходованиеНоменклатуры.КоличествоРасход) > 0 КАК ЕстьПриходТовара
		|		ИЗ
		|			РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Обороты(, &Дата, , ) КАК ОприходованиеНоменклатуры
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОприходованиеНоменклатуры.Документ) КАК ПоступленияТоваров
		|		ПО Взаиморасчеты.Инвойс = ПоступленияТоваров.Инвойс";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Инвойсы.Загрузить(Выгрузка); 
	
	масИнвойсыДокумента = Параметры.ИнвойсыТЧ.Выгрузить().ВыгрузитьКолонку("Инвойс"); 
	Если масИнвойсыДокумента.ВГраница() > -1 Тогда
		НайдСтроки = Инвойсы.НайтиСтроки(Новый Структура("Инвойс", масИнвойсыДокумента[0])); 
		Если НайдСтроки.Количество() > 0 Тогда
			НайдСтрока = НайдСтроки[0];
			НайдСтрока.ОстатокДолга = НайдСтрока.ОстатокДолга - Параметры.СуммаКР;
		КонецЕсли;
	КонецЕсли;
	ВыбранныеИнвойсы.ЗагрузитьЗначения(масИнвойсыДокумента);
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	// ВыбранныеИнвойсы
	
	ЭлементОформления = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Метаданные.ЭлементыСтиля.ЦветФонаСтрокиИсключаемойИзВыбора.Значение);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина)); 
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Инвойсы.Инвойс"); 
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = ВыбранныеИнвойсы;
	ЭлементОтбора.Использование  = Истина;
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ИнвойсыИнвойс"); 
	ОформляемоеПоле.Использование = Истина;
	
	// Состояние (статусы)

	Запр = Новый Запрос; 
	Запр.Текст = "ВЫБРАТЬ
	             |	ЦветаОформления.Значение КАК Цвет,
	             |	ЦветаОформления.Настройка.ИмяПредопределенныхДанных КАК Статус
	             |ИЗ
	             |	РегистрСведений.ЦветаОформления КАК ЦветаОформления
	             |ГДЕ
	             |	ЦветаОформления.Настройка.Родитель = &ГруппаНастроек
	             |	И ЦветаОформления.Значение <> """"";
	Запр.УстановитьПараметр("ГруппаНастроек", ПланыВидовХарактеристик.ЦветаОформления.СтатусыПривязкиИнвойсов);
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		ЭлементОформления = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Выборка.Цвет));
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Инвойсы.Состояние");
		ЭлементОтбора.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Перечисления.Долги[СтрЗаменить(Выборка.Статус,"Инв_","")];
		ЭлементОтбора.Использование 	= Истина;
		
		ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле 			= Новый ПолеКомпоновкиДанных("ИнвойсыСостояние");
		ОформляемоеПоле.Использование 	= Истина;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьИтоги();

КонецПроцедуры

#КонецОбласти


#Область СобытияТаблицы

&НаКлиенте
Процедура ИнвойсыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПометкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Инвойсы.ТекущиеДанные;
	Если ТекДанные.Пометка Тогда
		//Если ТекДанные.Дубль = Ложь или ТекДанные.Остаток > 0 Тогда 
		//	Если СуммаОстаток <= ТекДанные.Остаток И СуммаОстаток > 0 Тогда
		//		ТекДанные.Долг = СуммаОстаток;
		//		ТекДанные.Остаток = ТекДанные.Остаток - ТекДанные.Долг;
		//		СуммаПривязано = СуммаПривязано + ТекДанные.Долг; 
		//		СуммаОстаток = СуммаДокумента - СуммаПривязано;
		//		Остаток = ТекДанные.Остаток;
		//		Сумма = ТекДанные.Сумма;
		//		ТекДанные.Состояние = ПолучитьСостояние(Остаток,Сумма);
		//	ИначеЕсли СуммаОстаток > ТекДанные.Остаток Тогда
		//		ТекДанные.Долг = ТекДанные.Остаток;
		//		ТекДанные.Остаток = ТекДанные.Остаток - ТекДанные.Долг;
		//		СуммаПривязано = СуммаПривязано + ТекДанные.Долг;
		//		СуммаОстаток = СуммаДокумента - СуммаПривязано;
		//		Остаток = ТекДанные.Остаток;
		//		Сумма = ТекДанные.Сумма;
		//		ТекДанные.Состояние = ПолучитьСостояние(Остаток,Сумма);
		//	ИначеЕсли СуммаОстаток = 0 Тогда
		//		ТекДанные.ВыборП = Ложь;
		//	КонецЕсли; 
		//ИначеЕсли ТекДанные.Дубль = Истина или ТекДанные.Остаток = 0 Тогда 
		//	ТекДанные.ВыборП = Ложь;
		//КонецЕсли;
	Иначе 
		//ТекДанные.Остаток = ТекДанные.Остаток + ТекДанные.Долг;
		//СуммаПривязано = СуммаПривязано - ТекДанные.Долг;
		//СуммаОстаток = СуммаДокумента - СуммаПривязано;
		//ТекДанные.Долг = "";
		//Остаток = ТекДанные.Остаток;
		//Сумма = ТекДанные.Сумма;
		//ТекДанные.Состояние = ПолучитьСостояние(Остаток,Сумма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Устанавливает сумму привязки автоматически
//
Процедура ИнвойсыПередНачаломИзменения(Элемент, Отказ)
	
	// для редактирования доступно только поле "Привязано"
	Если Элемент.ТекущийЭлемент.Имя <> "ИнвойсыПривязано" Тогда
		Возврат;
	КонецЕсли;

	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные.Состояние = ПредопределенноеЗначение("Перечисление.Долги.Полностью") Тогда 
		Сообщить("" + текДанные.Инвойс + " оплачен полностью!");
		//Отказ = Истина;
		//Возврат;
	КонецЕсли;
	
	СуммаДоРедактирования = ТекДанные.Привязано;
	Если СуммаНеПривязано > 0 Тогда  // если есть что привязать, сделаем это автоматически
		лМожноПривязать = СуммаДоРедактирования + Мин(ТекДанные.ОстатокДолга, СуммаНеПривязано);  
		ТекДанные.Привязано		= лМожноПривязать;
		//ТекДанные.ОстатокДолга	= ТекДанные.ОстатокДолга - ТекДанные.Привязано;  
	 	ТекДанные.ОстатокДолга = ТекДанные.Сумма / Курс - ТекДанные.Привязано;	
		//СуммаПривязано 			= СуммаПривязано + лМожноПривязать;
		//СуммаНеПривязано 		= СуммаНеПривязано - лМожноПривязать;
		//ОбновитьИтоги();
		СуммаПривязано = Инвойсы.Итог("Привязано");
		СуммаНеПривязано = СуммаОбщая - СуммаПривязано;
		ОбновитьИтоги();  
		
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ИнвойсыПриИзменении(Элемент)
	
	// для редактирования доступно только поле "Привязано"
	Если Элемент.ТекущийЭлемент.Имя <> "ИнвойсыПривязано" Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элемент.ТекущиеДанные; 
	Если ТекДанные.Привязано > СуммаДоРедактирования Тогда
		лМожноПривязать = Мин(ТекДанные.Привязано - СуммаДоРедактирования, СуммаНеПривязано); 
		ТекДанные.Привязано = СуммаДоРедактирования + лМожноПривязать;
	КонецЕсли;
	
	ТекДанные.ОстатокДолга = ТекДанные.Сумма / Курс - ТекДанные.Привязано;
	
	СуммаПривязано = Инвойсы.Итог("Привязано");
	СуммаНеПривязано = СуммаОбщая - СуммаПривязано;
	ОбновитьИтоги();  
  	
КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ИнвойсыИнвойс" Тогда                                        
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элемент.ТекущиеДанные.Инвойс); 
	КонецЕсли;  

КонецПроцедуры

#КонецОбласти 


&НаКлиенте
Процедура ОбновитьИтоги()
	
	ЦвОстатка = ?(СуммаНеПривязано > 0, "ЧИСЛО_ЦВ2", "ЧИСЛО_ЦВКРАСНЫЙ_ТЕКСТ");

	СтруктураИтогов = Новый Структура;
	Стр = СтрШаблон("<p>%1: %2 %3 %4 %5 %3</p>", 
						омСервер.Фрмт(НСтр("ru = 'Еще можно привязать'; en = 'You can also bind'"), "НАДПИСЬ_Ж"), 
					    омСервер.Фрмт(СуммаНеПривязано, ЦвОстатка),
					    омСервер.Фрмт(Валюта, "НАДПИСЬ_ЦВ2"),
	                    омСервер.Фрмт(НСтр("ru = 'из'; en = 'of'"), "НАДПИСЬ_Ж"),
					    омСервер.Фрмт(СуммаОбщая, "ЧИСЛО_ЦВ2")
						);
	СтруктураИтогов.Вставить("Итоги", Стр); 

	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));
	
	Элементы.СохранитьВыбор.КнопкаПоУмолчанию = СуммаНеПривязано = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВыбор(Команда)
	
	ТребуетсяПометкаНеПересчитыватьПриход = Ложь;
	МассивИ = Новый Массив;  
	
	Для Каждого строкаВ из Инвойсы Цикл
		Если строкаВ.Привязано > 0 Тогда 
			МассивИ.Добавить(строкаВ);  
			Если строкаВ.ЕстьПриходТовара И НЕ строкаВ.НеПересчитыватьПриходТовара Тогда
				ТребуетсяПометкаНеПересчитыватьПриход = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  
	
	//Если ТребуетсяПометкаНеПересчитыватьПриход Тогда
	//	Если НЕ клВопрос("Есть инвойс(ы), по которым получен товар.
	//					|Цены этих приходных накладных будут пересчитаны.
	//					|Вы уверены, что
	//					|пометка 'НЕ ПЕРЕСЧИТЫВАТЬ ПРИХОД' не нужна?") Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//ЭтаФорма.Закрыть(МассивИ);
    Если ТребуетсяПометкаНеПересчитыватьПриход Тогда
		клВопрос(Новый ОписаниеОповещения("СохранитьВыборПослеПодтверждения", ЭтотОбъект, МассивИ),
			"Есть инвойс(ы), по которым получен товар.
			|Цены этих приходных накладных будут пересчитаны.
			|Вы уверены, что
			|пометка 'НЕ ПЕРЕСЧИТЫВАТЬ ПРИХОД' не нужна?");
	Иначе
		ЭтаФорма.Закрыть(МассивИ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВыборПослеПодтверждения(Результат, МассивИ) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	ЭтаФорма.Закрыть(МассивИ);
КонецПроцедуры


&НаКлиенте
Процедура СвязанныеДокументы(Команда)

	ОткрытьФорму("ОбщаяФорма.ФормаСтруктурыПодчиненности", Новый Структура("ДокументСсылка", Элементы.Инвойсы.ТекущиеДанные.Инвойс), , Истина, );

КонецПроцедуры


&НаКлиенте                              
Процедура ТолькоНеоплаченные(Команда)

	ТолькоНеОплаченные = НЕ ТолькоНеОплаченные;
	Элементы.ФормаТолькоНеоплаченные.Пометка = ТолькоНеОплаченные;
	
	Если ТолькоНеОплаченные Тогда
		Отбор = Новый Структура("Неоплачено", Истина);
		Элементы.Инвойсы.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);	
	Иначе
		Элементы.Инвойсы.ОтборСтрок = Неопределено;		
	КонецЕсли; 
	
КонецПроцедуры
